In [3]:
import pandas as pd
import numpy as np

In [4]:
df = pd.DataFrame(
    [
        ("bird", "Falconiformes", 389.0),
        ("bird", "Psittaciformes", 24.0),
        ("mammal", "Carnivora", 80.2),
        ("mammal", "Primates", np.nan),
        ("mammal", "Carnivora", 58),
    ],
    index=["falcon", "parrot", "lion", "monkey", "leopard"],
    columns=("class", "order", "max_speed"),
)


df

          class           order  max_speed
falcon     bird   Falconiformes      389.0
parrot     bird  Psittaciformes       24.0
lion     mammal       Carnivora       80.2
monkey   mammal        Primates        NaN
leopard  mammal       Carnivora       58.0

In [5]:
grouped = df.groupby("class")
grouped

In [7]:

grouped = df.groupby("order", axis="columns")
grouped

In [17]:
df2 = pd.DataFrame({"X": ["B", "B", "A", "A"], "Y": [1, 2, 3, 4], "C": [1,4,5,6]})
df2

   X  Y  C
0  B  1  1
1  B  2  4
2  A  3  5
3  A  4  6

In [50]:

df2[['X','C']].groupby(["X"]).mean()

     C
X
A  5.5
B  2.5